/*
 * Знайомство з масивами
 * - Объявлення
 * - Індексація
 * - Довжина
 * - Індекс останнього елемента
 * - Переопреділення
 *
 * 'Mango', 'Kiwi', 'Poly', 'Ajax'
 */


/*
 * Передача по посиланню і по значенню
 * - Примітиви і складні типи данних
 * - Посисальна рівність (referential equality)
 */


/*
 * Перебор (ітерація) масиву
 * - for - якщо потрібен індекс або потрібно змінити елемент масиву
 * - for...of - якщо індекс не потрібен і в масиві нічого змінювати не потрібно
 */

// Методи split() і join()
// Методи indexOf() і includes()
// Методи push(), pop(), shift(), unshift()
// Метод slice()
// Метод splice()
// Метод concat()