/*
1. Отримати дані про користувачів з API та відобразити їх на веб-сторінці. Можна використати наступний API: https://jsonplaceholder.typicode.com/use1. 
2. Завантажити зображення з сервера та відобразити його на веб-сторінці. Можна використати наступний API для тестування: https://jsonplaceholder.typicode.com/photos1. 
3. Завантажити список елементів з API та забезпечити фільтрацію результатів за допомогою параметрів запиту. Наприклад, ви можете завантажити список книг з API та дозволити користувачу фільтрувати результати за жанром, автором, роком видання тощ1. 
4. Зробити запит до API за даними та вивести їх на екран у вигляді списк1. 
5. Зробити запит до API за списком елементів та відобразити їх у випадаючому списку. Після вибору елементу зі списку, відобразити деталі цього елемент1. 
6. Створити простий блог, де користувач може відправити HTTP GET запит до API для отримання списку постів та відобразити їх на сторінці. Кожен пост має мати заголовок, автора та текс1. 
7. Створити простий інтерфейс для пошуку відомостей про книги. Користувач може ввести назву книги та відправити HTTP GET запит до API для отримання списку книг, що відповідають його запиту. Кожна книга має мати обкладинку, назву, автора та опи1. 
8. Створити простий інтерфейс для перевірки погоди у певному місці. Користувач може ввести назву міста та відправити HTTP GET запит до API для отримання поточних погодних умов. Дані про погоду мають бути відображені на сторінці у зрозумілому користувачеві форматі.
*/