/*
1. Створити об'єкт "студент" з властивостями "ім'я", "вік" та "курс". Додати метод "вітатися", який виводитиме повідомлення з вітанням студент1. 
2. Створити об'єкт "працівник" з властивостями "ім'я", "посада" та "зарплата". Додати метод "збільшити зарплату", який збільшуватиме зарплату працівника на задану сум1. 
3. Створити об'єкт "користувач" з властивостями "ім'я", "електронна пошта" та "пароль". Додати метод "перевірити пароль", який повертатиме true, якщо введений пароль співпадає з паролем користувач1. 
4. Створити об'єкт "пристрій" з властивостями "назва", "виробник" та "рік випуску". Додати метод "вивести інформацію", який виводитиме інформацію про пристрій у консол1. 
5. Створити об'єкт "калькулятор" з методами "додати", "відняти", "помножити" та "поділити". Кожен з методів приймає два числа та повертає результат відповідної математичної операції.
*/