/*
 * Напиши скрипт вибору готеля по кількості зірок.
 * 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
 *
 * Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
 * 'Токої кількості зірок немає'
 */

// const stars = 1;
// let price;


/*
 * Напиши скрипт вибору готеля по кількості зірок.
 * 1,2 - 20$, 3,4 - 30$, 5 - 120$
 */


/*
 * Напиши скрипт вибору опції доставки товару.
 * Опція зберігається в змінній option: 1 - самовивоз, 2 - кур"єр, 3 - пошта
 *
 * В змінну message записати повідомлення в залежності від опції.
 * - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
 * - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
 * - 'Посилка буде відправлена сьогодня'
 * - 'Вам передзвонит менеджер'
 */

