// 1. Вивести в консоль числа від 1 до 5 всіма циклами

// 2. Який буде останній результат коду:
        // let num = 3;
        // while (num) {
        //     console.log(num);
        //     num -= 1;
        // }

// 3. Переписати на while
        // for (let number = 0; number < 5; number += 1) {
        //     console.log(`Число ${number}`);
        // }

// 4. Написати скрипт який буде перевіряти середній бал успішності учня.
// Прервати роботу циклу, коли середній бал буде меньше 7.

// 5. Виведіть в консоль всі непарні числа за допомогою циклу for

// 6. Напиши цикл, який пропонує в prompt ввести число, більше 100. Якщо відвідувач ввів інше число – попросити ввести ще раз и т.д.
// Цикл повинен питати число поки відвідувач не введе число, більше 100, або не натисне кнопку Відміна (ESC).



