/* ЗАВДАННЯ 5
       * Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні 
       * сторінки в prompt.
       * Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. Обов'язково 
       * використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.
       * Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 
       * 'У вашій країні доставка недоступна'.
       * Нижче наведено список країн і вартість доставки.
       * Китай - 100 кредитів
       * Чилі - 250 кредитів
       * Австралія - 170 кредитів
       * Індія - 80 кредитів
       * Ямайка - 120 кредитів 
       * */



