// Яке значення виведе наступний код і чому
// for (let i = 0; i < 5; i+=       ) alert( i );

// Написати програму яка перевіряє чи введене число через prompt 
// потрапляє в діапазон від 55 до 99 включно. Якщо так, вивести в 
// консоль "Число потрапляє в діапазон". Якщо ні, вивести в консоль 
// "Число не потрапляє в діапазон".

// 1. створити змінну і записати в неї число з prompt
// 2. перевірити чи число попадає в діапазонн

// const number = prompt('Enter number');

// if(number >= 55 && number <= 99){
//     console.log("Число потрапляє в діапазон");
// } else {
//     console.log("Число не потрапляє в діапазон");
// }

//  let num = 1;
//  while (num <= 10) {
//     console.log(num);
//     num += 1;
//     console.log(num);
//  }

 for (let i = 1; i <= 110; i+=1) {
    if (i % 2 === 0) {
        console.log('Число парне', i); 
        i /= 2;
        
    } else {
        console.log('Число не парне', i);
        i = i * 3 + 1;        
    }
        
 }

