// indexOf!!!!!!!!!!!!!

const str = "Привіт! Як справи?"
console.log(str.length);
console.log(str.indexOf("!"));
console.log(str.indexOf("П"));

// 2. Знайти довжину рядка довільного змісту

// 3. Написати скрипт який виведе рядок в форматі
    // "Студент a b записався в школу d на курси i в групу h"
    // підставивши замість a b d i h значення змінних.

// 4. Зміни ім"я товара на "Repair droid" і збільшіть його ціну
    // на 1500 кредитів. Переопреділіть значення змінних pricePerItem і productName
    // після їх об"явлення.
    // let productName = "Droid";
    // let pricePerItem = 2000;

// 5. Об"явіть змінні використавуючи ключові слова const та let та присвойте
    // їм відповідні значення.
    // topSpeed - число 160.
    // distance - число 617.54.
    // login - рядок "mango935".
    // isOnline - буль true.
    // isAdmin - буль false.

// 6. Доповни код, надавши змінній totalPrice вираз для підрахунку загальної суми 
    // замовлення. Змінна pricePerItem зберігає ціну однієї одиниці товару, 
    // а orderedQuantity - кількість одиниць товару в замовлення.
    // const pricePerItem = 3500;
    // const orderedQuantity = 4;

// 7. Магазин з продажу ремонтних дроїдів готовий до відкриття, залишилося написати 
    // скрипт для їхнього замовлення. Оголоси змінні та надай їм відповідні значення:
    // pricePerDroid - ціна одного дроїда, значення 800
    // orderedQuantity - кількість дроїдів у замовленні, значення 6
    // deliveryFee - вартість доставки, значення 50
    // totalPrice - загальна сума замовлення до оплати, не забудь про вартість доставки
    // message - повідомлення про стан замовлення у форматі "You ordered droids worth <total price> credits. Delivery (<delivery fee> credits) is included in total price."

// 8. Напиши скрипт який просить користувача ввести число та ступінь,
// зводить число в цей ступінь і виводить результат у консоль.

// 9. Ціна 1кг м"яса 200грн. Напиши скрипт який просить користувача ввести кількість м"яса в замовлені в кг. 
    // Порахуй загальну вартість замовлення та виведи результат користувачу.

// 10.  У прямокутного трикутника дві сторони n (зі значенням 3см) і m (зі значенням 4см). Знайдіть гіпотенузу k по теоремі Піфагора.

// 11. Напиши скрип який буде збільшувати заробітню платню робітника на 10%. Початкова сума зп - 25000.589612 грн. Результат округли до сотої та виведи в консоль.

// 12. Створіть змінну яка буде генерувати псевдовипадкове число від 0 до 1 та зміни діапазон від 50 до 100.

// 13. Напиши скрипт який знайде довжину рядка "Hello, world! Javascript is awesome!". 
    // Зробить всі літери великими. Знайде в рядку
    // слово "javascript". Всі маніпуляції не повинні змінювати оригінальний рядок.


    // 1. Рандомний вибір кольору боді
    