/*
Створити простий інтернет-магазин з можливістю додавання 
товарів у кошик, оформлення замовлення та оплати.

Технічні вимоги:

1. Товар зберігається в db.json
2. На головній сторінці має бути відображений список всіх товарів, 
    де можна переглянути їхні зображення та назви.
3. Після кліку на товар користувач може переглянути детальну 
    інформацію про товар (назва, опис, ціна, зображення).
4. Можливість додавання товарів до кошика. Кошик повинен 
    відображати всі додані товари з їхніми назвами та цінами.
5. Після оформлення замовлення користувач повинен бути 
    перенаправлений на сторінку з оплатою. Для цього необхідно 
    заповнити форму з інформацією про замовлення (ім'я, електронна 
    адреса, адреса доставки тощо).
8. Після успішної оплати користувач повинен отримати повідомлення 
    про успішне оформлення замовлення.
 
    Кроки до реалізації завдання

    1. Створіть файл db.json, в якому буде зберігатися інформація про 
 товари. Файл має містити масив об'єктів, кожен з яких 
 представляє один товар із властивостями, такими як назва, 
 опис, ціна, зображення та інші необхідні деталі.

    2. На головній сторінці вашого магазину використайте JavaScript для 
завантаження товарів з файлу db.json та відображення їх у 
вигляді списку з зображеннями та назвами. Ви можете використовувати
 HTML та CSS для створення потрібного макету та розмітки.

    3. Додайте обробники подій до кожного товару, щоб при кліку на нього 
відкривалася сторінка з детальною інформацією про товар. 
На цій сторінці ви можете відобразити всю додаткову інформацію 
про товар, таку як опис, ціна, зображення тощо.

    4. Для реалізації функціональності додавання товарів до кошика 
використовуйте JavaScript. Додайте кнопку "Додати до кошика" 
на сторінці детальної інформації про товар. При кліку на цю 
кнопку ви можете зберігати вибраний товар у змінній або масиві, які представляють кошик. Відображайте вибрані товари кошика разом з їхніми назвами та цінами на сторінці кошика.

    5. Додайте форму оформлення замовлення на сторінку кошика. 
Ця форма повинна містити поля для введення інформації про 
замовлення, такої як ім'я, електронна адреса, адреса доставки тощо. Додайте кнопку "Оформити замовлення", яка буде відправляти дані з форми на сервер для обробки.
*/

const productsList = document.querySelector('.products-js');


getAllProducts()
.then(products=> {
    const items = products.map(createProductsItem);
    productsList.insertAdjacentHTML("beforeend", ...items);
})

async function getAllProducts() {
    const res = await fetch('http://localhost:3000/products');
    const productData =  await res.json();

    return productData;
}

function createProductsItem({image, name}) {
    return `<li class="item">
                <img width="250" src="${image}" alt="${name}">
                <p class="name">${name}</p>
                <button type="button">Додати в кошик</button>
            </li>
            `   
}

